tap "homebrew/cask"
tap "homebrew/services"
tap "homebrew/cask-fonts"
cask_args appdir: "/Applications"

# CLI Tools
brew "mas"
brew "curl"
brew "git"
brew "mc"
brew "mtr"
brew "node"
brew "nvm"
brew "nmap"
brew "openssl"
brew "tldr"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "youtube-dl"

# Applications that doesn't exist in Mac App Store
cask "appcleaner"
cask "dash"
cask "google-chrome"
cask "figma"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "font-fira-code"
cask "font-fira-code-for-powerline"
cask "font-inter"
cask "gimp"
cask "hiddenbar"
cask "iterm2"
cask "kindle"
cask "monitorcontrol"
cask "obsidian"
cask "paragon-ntfs"
cask "postman"
cask "radio-silence"
cask "rectangle"
cask "sourcetree"
cask "sketch"
cask "spark"
cask "spotify"
cask "tableplus"
cask "transmission"
cask "viber"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# Quick Look Plugins
cask "quicklook-json"

# Applications from Mac App Store
mas "1Password 7 - Password Manager", id: 1333542190
mas "AdGuard for Safari", id: 1440147259
mas "Bitwarden", id: 1352778147
mas "Slack", id: 803453959
mas "Spark – Email App by Readdle", id: 1176895641
mas "Telegram", id: 747648890
mas "Trello", id: 1278508951
mas "Twitter", id: 409789998
mas "The Unarchiver", id: 425424353
mas "Whatsapp", id: 1147396723