tap "homebrew/cask"
tap "homebrew/services"
cask_args appdir: "/Applications"

brew "mas"
brew "curl"
brew "git"
brew "mc"
brew "mtr"
brew "node"
brew "nmap"
brew "openssl"
brew "tldr"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

cask "dash"
cask "google-chrome"
cask "gimp"
cask "hiddenbar"
cask "iterm2"
cask "kindle"
cask "obsidian"
cask "postman"
cask "radio-silence"
cask "sourcetree"
cask "sketch"
cask "spotify"
cask "tableplus"
cask "transmission"
cask "viber"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

mas "1password", id: 1333542190
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Telegram", id: 747648890
mas "Twitter", id: 409789998
mas "The Unarchiver", id: 425424353
mas "Whatsapp", id: 1147396723