tap "homebrew/cask"
tap "homebrew/services"
tap "homebrew/cask-fonts"
cask_args appdir: "/Applications"

# CLI Tools
brew "ansible"
brew "awscli"
brew "composer"
brew "curl"
brew "d2"
brew "git"
brew "htop"
brew "jsonnet"
brew "lua"
brew "liajit"
brew "mas"
brew "mc"
brew "mtr"
brew "node"
brew "ncdu"
brew "nvm"
brew "nmap"
brew "openssl"
brew "terraform"
brew "tldr"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# Applications that doesn't exist in Mac App Store
cask "appcleaner"
cask "balenaetcher"
cask "google-chrome"
cask "figma"
cask "fork"
cask "hiddenbar"
cask "iterm2"
cask "monitorcontrol"
cask "obsidian"
cask "paragon-ntfs"
cask "phpstorm"
cask "postman"
cask "pycharm"
cask "radio-silence"
cask "rectangle"
cask "skype"
cask "spotify"
cask "sublime-text"
cask "tableplus"
cask "transmission"
cask "viber"
cask "viscosity"
cask "vscodium"
cask "vlc"
cask "yandex"
cask "zoom"

# Applications from Mac App Store
mas "1Password 7 - Password Manager", id: 1333542190
mas "HP Smart for Desktop", id: 1474276998
mas "NordVPN: VPN Fast & Secure", id: 905953485
mas "Pixelmator Pro", id: 1289583905
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "WireGuard", id: 1451685025
